And test after installing terraform:


#### Show version

```bash
$ which terraform
/usr/local/bin/terraform

$ terraform --version
Terraform v1.14.4
on linux_amd64
+ provider registry.opentofu.org/hashicorp/aws v5.100.0
```

#### Plan

```bash
$ ../terraformsh plan         
../terraformsh: Info: Found terraform command 'plan'
../terraformsh: Warning: No -b option passed! Potentially using only local state.

+ terraform init -input=false -reconfigure -force-copy
Initializing the backend...
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.90"...
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!
+ terraform get -update=true
+ terraform validate
Success! The configuration is valid.

+ terraform plan -input=false -out=/home/thomas/github/Th0masL/terraformsh/test_stack/tf.fb7eac8ae2.plan

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_user.test_user will be created
  + resource "aws_iam_user" "test_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "terraform-test-user"
      + path          = "/"
      + tags          = {
          + "Purpose" = "Terraform test"
        }
      + tags_all      = {
          + "Purpose" = "Terraform test"
        }
      + unique_id     = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + created_user = "terraform-test-user"
```